In [2]:
import pandas as pd

data = {
    "name": ["Amit","Neha","Raj","Sara","Kunal","Rohit","Priya","Arjun","Meera","Vikas","Pooja","Nikhil"],
    "city": ["Pune","Mumbai","Pune","Delhi","Pune","Mumbai","Delhi","Pune","Mumbai","Delhi","Pune","Mumbai"],
    "age": [22,25,23,26,24,28,27,21,29,30,22,26],
    "salary": [30000,45000,35000,50000,40000,52000,48000,31000,47000,51000,36000,53000]
}

df = pd.DataFrame(data)
df

      name    city  age  salary
0     Amit    Pune   22   30000
1     Neha  Mumbai   25   45000
2      Raj    Pune   23   35000
3     Sara   Delhi   26   50000
4    Kunal    Pune   24   40000
5    Rohit  Mumbai   28   52000
6    Priya   Delhi   27   48000
7    Arjun    Pune   21   31000
8    Meera  Mumbai   29   47000
9    Vikas   Delhi   30   51000
10   Pooja    Pune   22   36000
11  Nikhil  Mumbai   26   53000

In [15]:
#show all names in a single variable

df["city"]

0      Pune
1    Mumbai
2      Pune
3     Delhi
4      Pune
Name: city, dtype: str

In [17]:
# show multiple column names
df[["name", "city"]]

    name    city
0   Amit    Pune
1   Neha  Mumbai
2    Raj    Pune
3   Sara   Delhi
4  Kunal    Pune

In [18]:
#show rows where city = pune

df["city"] == "Pune"

0     True
1    False
2     True
3    False
4     True
Name: city, dtype: bool

In [19]:
df

    name    city  age  salary
0   Amit    Pune   22   30000
1   Neha  Mumbai   25   45000
2    Raj    Pune   23   35000
3   Sara   Delhi   26   50000
4  Kunal    Pune   24   40000

In [20]:
df["city"] == "Pune"

0     True
1    False
2     True
3    False
4     True
Name: city, dtype: bool

In [42]:
df[ (df["salary"]>40000) ]

   name    city  age  salary
1  Neha  Mumbai   25   45000
3  Sara   Delhi   26   50000

In [43]:
# show those rows where salary > 40000
df[df["salary"] > 40000]

   name    city  age  salary
1  Neha  Mumbai   25   45000
3  Sara   Delhi   26   50000

In [44]:
#2 conditions in a single query

df[ (df["city"]=="Pune") & (df["salary"]>35000) ]

    name  city  age  salary
4  Kunal  Pune   24   40000

In [48]:
#2 conditions with OR (|)

df[ (df["city"] == "Delhi") | (df["age"] <23) ]

   name   city  age  salary
0  Amit   Pune   22   30000
3  Sara  Delhi   26   50000

In [62]:
#Selecting columns after filtering

df.loc[ (df["city"] == "Pune"), ["name","city"] ]

    name  city
0   Amit  Pune
2    Raj  Pune
4  Kunal  Pune

In [67]:
#Selecting multiple columns after filtering

df.loc[df["salary"] >= 40000, ["name", "city"]]

    name    city
1   Neha  Mumbai
3   Sara   Delhi
4  Kunal    Pune

In [74]:
#Add a new column with values for each row
df["tax"] = df["age"] *0.10
df

    name    city  age  salary  tax
0   Amit    Pune   22   30000  2.2
1   Neha  Mumbai   25   45000  2.5
2    Raj    Pune   23   35000  2.3
3   Sara   Delhi   26   50000  2.6
4  Kunal    Pune   24   40000  2.4

In [78]:
#Getting a boolean mask
df["salary"] > 40000

0    False
1     True
2    False
3     True
4    False
Name: salary, dtype: bool

In [83]:
#Counting rows and columns in filtered dataset
df[ (df["city"] == "Pune") ].shape

(3, 5)

In [87]:
#unique values
df["city"].unique()

<StringArray>
['Pune', 'Mumbai', 'Delhi']
Length: 3, dtype: str

In [88]:
# count of each city
df["city"].value_counts()

city
Pune      3
Mumbai    1
Delhi     1
Name: count, dtype: int64

In [89]:
#group by 
df.groupby("city")["salary"].mean()

city
Delhi     50000.0
Mumbai    45000.0
Pune      35000.0
Name: salary, dtype: float64

In [13]:
df[ ( df["city"] == "Pune") ]

    name  city  age  salary
0   Amit  Pune   22   30000
2    Raj  Pune   23   35000
4  Kunal  Pune   24   40000

In [15]:
df

    name    city  age  salary
0   Amit    Pune   22   30000
1   Neha  Mumbai   25   45000
2    Raj    Pune   23   35000
3   Sara   Delhi   26   50000
4  Kunal    Pune   24   40000

In [19]:
#Group by - After groupby, you must apply an aggregation to get a result (like sum, mean, max, count, etc.)
df.groupby("city")["age"].max()

city
Delhi     26
Mumbai    25
Pune      24
Name: age, dtype: int64

In [21]:
#Group by - Multiple aggerations 
df.groupby("city")["salary"].agg(["mean", "max", "min"])

           mean    max    min
city
Delhi   50000.0  50000  50000
Mumbai  45000.0  45000  45000
Pune    35000.0  40000  30000

In [22]:
df.groupby("city").size()

city
Delhi     1
Mumbai    1
Pune      3
dtype: int64

In [23]:
df

    name    city  age  salary
0   Amit    Pune   22   30000
1   Neha  Mumbai   25   45000
2    Raj    Pune   23   35000
3   Sara   Delhi   26   50000
4  Kunal    Pune   24   40000

In [24]:
#Group by size
df.groupby("city").size()

city
Delhi     1
Mumbai    1
Pune      3
dtype: int64

In [27]:
#Groupby - total salary per city
df.groupby("city")["salary"].sum()

city
Delhi      50000
Mumbai     45000
Pune      105000
Name: salary, dtype: int64

In [28]:
#Order by ascending
df.sort_values("salary")

    name    city  age  salary
0   Amit    Pune   22   30000
2    Raj    Pune   23   35000
4  Kunal    Pune   24   40000
1   Neha  Mumbai   25   45000
3   Sara   Delhi   26   50000

In [29]:
#Order by descending
df.sort_values("salary", ascending=False)

    name    city  age  salary
3   Sara   Delhi   26   50000
1   Neha  Mumbai   25   45000
4  Kunal    Pune   24   40000
2    Raj    Pune   23   35000
0   Amit    Pune   22   30000

In [33]:
#Get first 2 highest salaries
df.sort_values("salary", ascending=False).head(2)

   name    city  age  salary
3  Sara   Delhi   26   50000
1  Neha  Mumbai   25   45000

In [36]:
#Smallest 2 salaries
df.nsmallest(2, "salary")

   name  city  age  salary
0  Amit  Pune   22   30000
2   Raj  Pune   23   35000

In [40]:
#largest 2 salaries
df.nlargest(2, "salary")

   name    city  age  salary
3  Sara   Delhi   26   50000
1  Neha  Mumbai   25   45000

In [18]:
#Oldest person in dataset
df.nlargest(1, "age")

    name   city  age  salary
9  Vikas  Delhi   30   51000

In [17]:
#sorting priority , city priority is greater than that of salary 
#hence salary priority is nested inside each city
df.sort_values(["city","salary"], ascending=[True, False])

      name    city  age  salary
9    Vikas   Delhi   30   51000
3     Sara   Delhi   26   50000
6    Priya   Delhi   27   48000
11  Nikhil  Mumbai   26   53000
5    Rohit  Mumbai   28   52000
8    Meera  Mumbai   29   47000
1     Neha  Mumbai   25   45000
4    Kunal    Pune   24   40000
10   Pooja    Pune   22   36000
2      Raj    Pune   23   35000
7    Arjun    Pune   21   31000
0     Amit    Pune   22   30000

In [14]:
#show the top values using .head() function 
df.sort_values(["city","salary"], ascending=[True, False]).head(4)

      name    city  age  salary
9    Vikas   Delhi   30   51000
3     Sara   Delhi   26   50000
6    Priya   Delhi   27   48000
11  Nikhil  Mumbai   26   53000

In [15]:
#Show top 3 highest salaries
df.sort_values("salary", ascending=False).head(3)

      name    city  age  salary
11  Nikhil  Mumbai   26   53000
5    Rohit  Mumbai   28   52000
9    Vikas   Delhi   30   51000

In [38]:
#higesht salaries from each cities
df.sort_values(["city","salary"], ascending=[True, False]) \
.groupby("city") \
.head(1)

      name    city  age  salary
9    Vikas   Delhi   30   51000
11  Nikhil  Mumbai   26   53000
4    Kunal    Pune   24   40000

In [41]:
#2nd higesht salaries from each cities
df.sort_values(["city","salary"], ascending=[True, False]) \
.groupby("city") \
.head(1) \
.offet(2)

AttributeError: 'DataFrame' object has no attribute 'offet'